'use strict';

console.log('Пользователь загадывает число в диапазоне от [1 до 100], программа пытается его угадать.\n' +
    '    Программа может задавать пользователю вопросы:\n' +
    '        Число равно ...? / Число больше ...? / Число меньше ...? и в зависимоти от ответа пользователя принимать решения.\n' +
    '    Пользователь может отвечать ДА, НЕТ, ВЫХОД.\n' +
    '    Игра заканчивается:\n' +
    '        если пользователь отвечает ВЫХОД\n' +
    '        если программа угадала число\n' +
    '        \n' +
    '    При решении используйте метод бинарного поиска - деление отрезка на 2.    \n' +
    '     ')
let num = null;
let answer = confirm('Загадайте число от 1 до 100 \n' +
    'Загаданное число больше 50?');

if answer === true;
    num > 50;
    answer = confirm('Загаданное число - четное?');
        if answer === true;
        for

else

